_posts_bak/2021-10-11-boj-7795.html
---
layout: post
title: BOJ 7795 먹을 것인가 먹힐 것인가
tags: STL 이분탐색
---

<div id="outline-container-org7e5ed29" class="outline-2">
<h2 id="org7e5ed29">BOJ 7795 먹을 것인가 먹힐 것인가?</h2>
<div class="outline-text-2" id="text-org7e5ed29">
<ul class="org-ul">
<li>lower bound를 적용하는 문제</li>
<li>잘 떠오르지 않는다.</li>
</ul>
</div>
</div>

<div id="outline-container-org6dba98e" class="outline-2">
<h2 id="org6dba98e">접근하기</h2>
<div class="outline-text-2" id="text-org6dba98e">
<ul class="org-ul">
<li>이중 loop로 찾을 수 있지만 느릴 것.</li>
<li>lower bound : K보다 같거나 큰 값이 처음으로 나타나는 위치</li>

<li>1번째 예제</li>
</ul>
<pre class="example">
A = {8, 1, 7, 3, 1}
sort(B) = {1, 3, 6}

lower_bound(B, 8) = B의 마지막 주소 - B시작주소 = 3
lower_bound(B, 1) = B시작 주소 - B시작주소 = 0
lower_bound(B, 7) = B마지막 주소 - B시작주소 = 3
lower_bound(B, 3) = 3의 위치 - B시작주소 = 1
lower_bound(B, 1) = B시작 주소 - B시작주소 = 0

3 + 0 + 3 + 1 + 0 = 7
</pre>
</div>
</div>

<div id="outline-container-org5ac0230" class="outline-2">
<h2 id="org5ac0230">코드</h2>
<div class="outline-text-2" id="text-org5ac0230">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;cstdio&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;algorithm&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;iostream&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">T</span>;
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>, <span style="color: #ff6347;">M</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">a</span>[20020];
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">b</span>[20020];

<span style="color: #8ae234; font-weight: bold;">void</span> <span style="color: #edd400; font-weight: bold;">solve</span>()
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d %d"</span>, &amp;N, &amp;M);

    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;a[i]);
    }
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;M;i++) {
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;b[i]);
    }

    sort(b, b+M);

    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">sum</span> = 0;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        <span style="color: #729fcf; font-weight: bold;">auto</span> <span style="color: #ff6347;">it</span> = lower_bound(b, b+M, a[i]);
        sum += (<span style="color: #8ae234; font-weight: bold;">int</span>)(it - b);
    }
    cout &lt;&lt; sum &lt;&lt; endl;
}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;T);    

    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">tc</span>=1;tc&lt;=T;tc++) {
        solve();
    }
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org5841067" class="outline-2">
<h2 id="org5841067">문제 링크</h2>
<div class="outline-text-2" id="text-org5841067">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/problem/7795">https://www.acmicpc.net/problem/7795</a></li>
</ul>
</div>
</div>
